E1mpire/HelloMaker-STM32/User/main.cpp
		 #elif SBUS_EN
			 #if FUTABA
	         if(f_bias > 1200) f_bias = 1000;
				 else if(f_bias < 800) b_bias = 1000;
				 if(f_bias > 1000)
				  { 	
					FR_scale = dl_map(1200-f_bias,0,200,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 1000)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-800,0,200,BIAS_SACLE,1.0);			   
				  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(f_bias > 1800) f_bias = 992;
				 else if(f_bias < 200) b_bias = 992;
				 if(f_bias > 992)
				  { 	
					FR_scale = dl_map(1712-f_bias,0,720,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 992)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-272,0,720,BIAS_SACLE,1.0);			   
				  } 
			 #endif
		 #endif
			
	}
     if( BackAdjust == 0)
	  {
		STMFLASH_Read(READ_BACK_ADDR,(u16*)DataAddress,SIZE);
		b_bias = DataAddress[0];

		#if IBUS_EN
			if(b_bias > 2000) b_bias = 1500;
			else if(b_bias < 1000) b_bias = 1500;
			if(b_bias > 1500)
			  { 	
				BR_scale = dl_map(2000-b_bias,0,500,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1500)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-1000,0,500,BIAS_SACLE,1.0);	   
			  }   
		 #elif SBUS_EN

		     #if FUTABA
	         if(b_bias > 1200) b_bias = 1000;
			 else if(b_bias < 800) b_bias = 1000;
			 if(b_bias > 1000)
			  { 	
				BR_scale = dl_map(1200-b_bias,0,200,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1000)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-800,0,200,BIAS_SACLE,1.0);	   
			  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(b_bias > 1800) b_bias = 992;
			 else if(b_bias < 200) b_bias = 992;
			 if(b_bias > 992)
			  { 	
				BR_scale = dl_map(1712-b_bias,0,720,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 992)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-272,0,720,BIAS_SACLE,1.0);	   
			  } 
			 #endif
		 #endif
	  }
}

#endif

#if SERVO_EN
void TaskTimeHandle(void)
  {
	static uint32 time = 20;
	if(gSystemTickCount > time)
	  {
		  time += 20;
		  ServoPwmDutyCompare();		
	  }
   }
#endif
/*
----------------------------------------------------------------------------------
*/
// LoRa系数定义

char Remote_on[10] = "12345678";  //开启遥控器的指令
char Remote_off[10] = "87654321";  //关闭遥控器进入程序控制的指令
char LR_Adjust[10] = "44444444";
char Goto_A[10] = "Go to A"; //去泊车点
char Goto_B[10] = "Go to B"; //去1号停车点
char Goto_C[10] = "Go to C"; //去2号停车点
int command = 1;     //发送的指令
extern int current_command = 1;	//当前的指令  值设置为1，默认从泊车点出发
uint8_t LoRa_buffer[100] = {0};
uint8_t RxLength = 0;
char *Remote_message =  "Remote Control activate!\n";
char *Self_message = "Self Control activate!\n";
char *error_message= "Command in wrong format!\n";

/*---------------------------------------------------------------------------*/
int main(void) 
{

	
	// ????
	bool OnOff = false;
	// ???????
    char buffer[50];
	// ????????????????led??????? 
    uint32_t publish_vel_time = 0;
	uint32_t previous_imu_time = 0;
	uint32_t previous_oled_time = 0;
	uint32_t previous_led_time = 0;
    uint32_t previous_debug_time = 0;
	uint32_t previous_motorprotec_time = 0;
	uint32_t previous_control_time = 0;
	uint32_t previous_battery_debug_time = 0;

	char battery_buffer[]= "The voltage is lower than 11.3V,Please charge! ";


	SystemInit();
	initialise();
	motor1.init();
	motor2.init();
	motor3.init();
	motor4.init();
	motor1.spin(0);
	motor2.spin(0);
	motor3.spin(0);
	motor4.spin(0);
	encoder1.init();
	encoder2.init();
	led.init();
	bat.init();
	#if RELAY_EN
	SwitchGpioInit();
   // Switch(0,FALSE);
	#endif
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,ENABLE);	  
	//-------JTAG------
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable,ENABLE);

	#if OLED_EN
	OLED_Init();
	#endif

	#if SERVO_EN
	InitPWM();
    InitTimer6();
	#endif

	// Serial口初始化
	SerialPrint.begin(115200);
	dlProtocol.begin();
	drv_uart_init(9600);  //LoRa模块的波特率固定为9600
	sonar_init(65535-1,72-1);  //程序规定好了检测周期为65535如果要改要同时改变sonar.cpp中TIM8IRQ里的参数
	Track_Init(); //循迹模块初始化
	Init_Route();

    #if IBUS_EN
    SerialBus.begin(115200);
    IBus.begin();

	#elif SBUS_EN
    sBus.begin();// SBUS初始化

	#elif PWM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	TIM2_Cap_Init(0xFFFF,72-1);
	#elif PPM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	#endif
    #if BIAS_ADJUST 
    Bias_check();  //读取偏差值
	#endif
	// led????
	led.on_off(OnOff);

	//test_control();


	/*-------------------------------???????????------------------------------------------*/
	// ?????
	#if 1
	while(1)
	{
		if((millis()-previous_LoRa_time)>=20)
	   {
		/*
		*LoRa通信模块，每20ms执行一次
		*/
		RxLength = drv_uart_rx_bytes(LoRa_buffer); //检测收到信号的长度
		if (RxLength != 0)
		{
			//drv_uart_tx_bytes((uint8_t*)LoRa_buffer,RxLength);
			if (str_cmp(LoRa_buffer,Remote_on))//比较指令是否相同，默认8位指令
			{
				Stop();
				OLED_Clear();
				drv_uart_tx_bytes((uint8_t*)Remote_message, 23+2);
				REMOTE_CONTROL_FLAG = 1; //进入遥控模式
			}
			else if (str_cmp(LoRa_buffer,Remote_off))
			{
				Stop();
				OLED_Clear();
				drv_uart_tx_bytes((uint8_t*)Self_message, 22+2);
				REMOTE_CONTROL_FLAG = 0;//刷新符号位,退出遥控模式
			}
			else if (str_cmp(LoRa_buffer,Goto_A))
			{
				drv_uart_tx_bytes((uint8_t*)"Now device is going to parking\n",30);
				command = 1;
			}
			else if (str_cmp(LoRa_buffer,Goto_B))
			{
				drv_uart_tx_bytes((uint8_t*)"Now device is going to Stop1\n",28);
				command = 2;
			}
			else if (str_cmp(LoRa_buffer,Goto_C))
			{
				drv_uart_tx_bytes((uint8_t*)"Now device is going to Stop2\n",28);
				command = 3;
			}
			else if (str_cmp(LoRa_buffer,LR_Adjust))
			{
				Lowspeed_Backward();
			}
			else
			{
				drv_uart_tx_bytes((uint8_t*)error_message+2, 28);
			}

		previous_LoRa_time = millis();
		}
	   }

	   #if CONNECT_DETEC
       if ((millis() - previous_command_time) >= 250){

		      if(b_rc_idle == true)  stop_base();
         }
	   #endif


        if(((millis() - previous_flysky_time) >= 1000 / IBUS_RATE) && REMOTE_CONTROL_FLAG)
        	{
			/*
			*程序控制模块1000/40=25ms执行一次
			*/   
        	  #if IBUS_EN
              ibus_control();     
			  #elif SBUS_EN
			  sbus_control();	
			  #elif PWM_EN
              pwm_control();
			  #elif PPM_EN
			  ppm_control();
              #endif
			  #endif
              previous_flysky_time = millis();				  
		    }

		#if (CONNECT_DETEC)
		if ((millis() - previous_command_time) >= 10 && !REMOTE_CONTROL_FLAG){  
			/*
			/程序控制部分，每10ms执行一次
			*/
			if (reach_parking)
			{
				parking(command);//进入停车程序 当收到不一样的指令时解除reach_parking状态
			}else
			{
				test_control(current_command);
			}
			
			

