E1mpire/HelloMaker-STM32/User/main.cpp
		}


		#if 1
        if((millis() - previous_movebase_time) >= (1000 / MOVEBASE_RATE))
        	{
			/*
			*获取速度，但是因为没有码盘所以无效
			*/   
               getVelocities();
               previous_movebase_time = millis();	  
		    }
		#endif

	    #if TILT_DETEC 
        if ((millis() - previous_imu_time) >= (1000 / IMU_PUBLISH_RATE)){
            if(!imu_is_initialized)
				{
	                imu_is_initialized = initIMU();
	                if(imu_is_initialized){
	                   
	                }else{
	     
	                }          
                }
			else{
                   
		         TiltAlarm();
            }
                previous_imu_time = millis();
			
           }
		 #endif

		

		 #if OLED_EN
		 
		 if((millis() - previous_oled_time) >= (1000 / OLED_RATE)&& REMOTE_CONTROL_FLAG){
			/*
			*OLED模块，每1000/50=20ms执行一次
			*/ 
			    static int count ,fresh,num=0;
				//???????,???????????????????????
				if (num++ >= 100)
				{
					num=0;
					OLED_ShowCHinese(0+50,  0, 6,  CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(18+50, 0, 7,  CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(36+50, 0, 10, CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(54+50, 0, 11, CNSizeWidth,  CNSizeHeight);

					OLED_ShowCHinese(0+50,  2, 4,  CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(18+50, 2, 5,  CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(36+50, 2, 10, CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(54+50, 2, 11, CNSizeWidth,  CNSizeHeight);
					
					OLED_ShowCHinese(0+50,  4, 8,  CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(18+50, 4, 9,  CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(36+50, 4, 10, CNSizeWidth,  CNSizeHeight);
					OLED_ShowCHinese(54+50, 4, 11, CNSizeWidth,  CNSizeHeight);
					#if TILT_DETEC
						OLED_ShowCHinese(0+50,  6, 12,  CNSizeWidth,  CNSizeHeight);
						OLED_ShowCHinese(18+50, 6, 13,  CNSizeWidth,  CNSizeHeight);
						OLED_ShowCHinese(36+50, 6, 14, CNSizeWidth,  CNSizeHeight);
						OLED_ShowCHinese(54+50, 6, 15, CNSizeWidth,  CNSizeHeight);
					#else
						OLED_ShowCHinese(0+50,  6, 16,  CNSizeWidth,  CNSizeHeight);
						OLED_ShowCHinese(18+50, 6, 17,  CNSizeWidth,  CNSizeHeight);
						OLED_ShowCHinese(36+50, 6, 18, CNSizeWidth,  CNSizeHeight);
						OLED_ShowCHinese(54+50, 6, 19, CNSizeWidth,  CNSizeHeight);
						CtrModeShow();
					#endif
				}
				
                if(fresh++ >= 20)
				  {
			          fresh = 0;
					  #if TILT_DETEC
					  OLED_ShowNumber(0, 0, (int)pitch,2,16);
					  #endif
					  OLED_ShowNumber(0, 48, PulsewidthX,4,16);
					  OLED_ShowNumber(0, 32, PulsewidthY,4,16);
					  #if SBUS_EN || IBUS_EN || PPM_EN
					  OLED_ShowNumber(0, 16, Pulsewidth_Power,4,16);
					  #endif
			          OLED_Refresh_Gram();
				  }



				 previous_oled_time = millis();
			
			
			
			}
			else if ((millis() - previous_oled_time) >= (1000 / OLED_RATE)&& !REMOTE_CONTROL_FLAG)
			{
				OLED_ShowString(0,0,"Snag:");
				OLED_ShowNumber(0,16,(int)distance,4,16);
				OLED_ShowString(0,32,"Trace:");
				/*
				if (TRACK1) OLED_ShowNumber(0,48,1,1,16); else if(!TRACK1) OLED_ShowNumber(0,48,0,1,16);
				if (TRACK2) OLED_ShowNumber(8,48,2,1,16); else if(!TRACK2) OLED_ShowNumber(8,48,0,1,16);
				if (TRACK3) OLED_ShowNumber(16,48,3,1,16); else if(!TRACK3) OLED_ShowNumber(16,48,0,1,16);
				if (TRACK4) OLED_ShowNumber(24,48,4,1,16); else if(!TRACK4) OLED_ShowNumber(24,48,0,1,16);
				if (TRACK5) OLED_ShowNumber(32,48,5,1,16); else if(!TRACK5) OLED_ShowNumber(32,48,0,1,16);
				*/
				
				if (TRACK6) OLED_ShowNumber(0,48,1,1,16); else if(!TRACK6) OLED_ShowNumber(0,48,0,1,16);
				if (TRACK7) OLED_ShowNumber(8,48,2,1,16); else if(!TRACK7) OLED_ShowNumber(8,48,0,1,16);
				if (TRACK8) OLED_ShowNumber(16,48,3,1,16); else if(!TRACK8) OLED_ShowNumber(16,48,0,1,16);
				if (TRACK9) OLED_ShowNumber(24,48,4,1,16); else if(!TRACK9) OLED_ShowNumber(24,48,0,1,16);
				if (TRACK10) OLED_ShowNumber(32,48,5,1,16); else if(!TRACK10) OLED_ShowNumber(32,48,0,1,16);
				
				//OLED_ShowNumber(0,48,track2,5,16);
				OLED_Refresh_Gram();
				previous_oled_time = millis();
			}
			
			

         #endif
         if((millis() - previous_led_time) >= (1000 / LED_RATE)){
            /*
			*LED闪烁1000/10=100ms执行一次LED模块
			*/   
			    static bool blink = false, start_blink = true;
                if((PulsewidthX == 0  || PulsewidthY == 0) &&  PC_start == false)//PC不知道是干什么的，但是别动它
				  {   
				      blink = !blink;
                      led.on_off(blink);		 
				  }
				 else if(start_blink == true){   
                         start_blink = false;
                         led.on_off(false);
         
				 }
				 previous_led_time = millis();
			}
         if(DEBUG)
		   {
	         if ((millis() - previous_debug_time) >= (1000 / DEBUG_RATE)) {
				/*
				*偏差调整模块，每1000/10=100ms执行一次
				*/						 
			     print_debug();
			     #if BIAS_ADJUST
				 BiasAdjst();
				 BiasadjustSave();
				 #endif
				 previous_debug_time = millis();
	            }
	        } 
          #if 1
		  if(DECORDE_EN)
		   {
	         if ((millis() - previous_motorprotec_time) >= (1000 / MOTORPROTEC_RATE)) {						 
			    /*
				*紧急停车模块，如果出现电机不转等异常情况则紧急停车
				*/
				  if((current_rpm1 == 0 && abs(pwm1) >= 240)||( current_rpm2 == 0 && abs(pwm2) >= 240)) i++;
			      else i = 0;
				  if(i >= 10) UrgencyStop = true;
				  else UrgencyStop = false;
				  if(UrgencyStop == true)  g_forcestop = true;
				   previous_motorprotec_time = millis();
	            }
	        } 
		  #endif
		

		
		
         
	 }
    #endif
   }